andoma/mios/src/platform/stm32n6/boot/stm32n6_bootloader.c
#include <stdint.h>
#include <stddef.h>

#include "stm32n6_reg.h"
#include "stm32n6_clk.h"

// =====================================================================
// Section attributes
// =====================================================================

#define BL __attribute__((section("bltext"), noinline))
#define BL_DATA __attribute__((section("bldata")))

#define BL_STR(name, val) \
  static const char name[] BL_DATA = val

// =====================================================================
// GPIO (same API as MIOS but self-contained in bootloader)
// =====================================================================

#define GPIO_PORT_ADDR(x) (0x56020000 + ((x) * 0x400))
#define GPIO_MODER(x)     (GPIO_PORT_ADDR(x) + 0x00)
#define GPIO_OTYPER(x)    (GPIO_PORT_ADDR(x) + 0x04)
#define GPIO_OSPEEDR(x)   (GPIO_PORT_ADDR(x) + 0x08)
#define GPIO_PUPDR(x)     (GPIO_PORT_ADDR(x) + 0x0c)
#define GPIO_BSRR(x)      (GPIO_PORT_ADDR(x) + 0x18)
#define GPIO_AFRL(x)      (GPIO_PORT_ADDR(x) + 0x20)
#define GPIO_AFRH(x)      (GPIO_PORT_ADDR(x) + 0x24)

#define GPIO(PORT, BIT) (((PORT) << 4) | (BIT))

#define GPIO_PA(x)  GPIO(0, x)
#define GPIO_PB(x)  GPIO(1, x)
#define GPIO_PC(x)  GPIO(2, x)
#define GPIO_PD(x)  GPIO(3, x)
#define GPIO_PE(x)  GPIO(4, x)
#define GPIO_PF(x)  GPIO(5, x)
#define GPIO_PG(x)  GPIO(6, x)
#define GPIO_PH(x)  GPIO(7, x)
#define GPIO_PN(x)  GPIO(13, x)

typedef enum {
  GPIO_PULL_NONE = 0,
  GPIO_PULL_UP = 1,
  GPIO_PULL_DOWN = 2,
} gpio_pull_t;

typedef enum {
  GPIO_PUSH_PULL = 0,
  GPIO_OPEN_DRAIN = 1,
} gpio_output_type_t;

typedef enum {
  GPIO_SPEED_LOW       = 0,
  GPIO_SPEED_MID       = 1,
  GPIO_SPEED_HIGH      = 2,
  GPIO_SPEED_VERY_HIGH = 3,
} gpio_output_speed_t;

typedef uint8_t gpio_t;


static void __attribute__((unused)) BL
gpio_conf_output(gpio_t gpio, gpio_output_type_t type,
                 gpio_output_speed_t speed, gpio_pull_t pull)
{
  const int port = gpio >> 4;
  const int bit = gpio & 0xf;

  clk_enable(CLK_GPIO(port));
  reg_set_bits(GPIO_OTYPER(port),  bit, 1, type);
  reg_set_bits(GPIO_OSPEEDR(port), bit * 2, 2, speed);
  reg_set_bits(GPIO_PUPDR(port), bit * 2, 2, pull);
  reg_set_bits(GPIO_MODER(port), bit * 2, 2, 1);
}


static void BL
gpio_conf_af(gpio_t gpio, int af, gpio_output_type_t type,
             gpio_output_speed_t speed, gpio_pull_t pull)
{
  const int port = gpio >> 4;
  const int bit = gpio & 0xf;

  clk_enable(CLK_GPIO(port));
  reg_set_bits(GPIO_OTYPER(port), bit, 1, type);
  reg_set_bits(GPIO_OSPEEDR(port), bit * 2, 2, speed);

  if(bit < 8)
    reg_set_bits(GPIO_AFRL(port), bit * 4, 4, af);
  else
    reg_set_bits(GPIO_AFRH(port), (bit - 8) * 4, 4, af);

  reg_set_bits(GPIO_PUPDR(port), bit * 2, 2, pull);
  reg_set_bits(GPIO_MODER(port), bit * 2, 2, 2);
}


static void __attribute__((unused)) BL
gpio_set_output(gpio_t gpio, int on)
{
  const int port = gpio >> 4;
  const int bit = gpio & 0xf;
  reg_wr(GPIO_BSRR(port), 1 << (bit + !on * 16));
}

// =====================================================================
// USART
// Boot ROM leaves clocks in nominal scenario (default fuses):
//   CPU=400MHz, AHB=150MHz, APB=150MHz
// =====================================================================

#define USART1_BASE  0x52001000
#define USART_CR1    0x00
#define USART_BRR    0x0c
#define USART_SR     0x1c
#define USART_TDR    0x28

// RCC_CCIPR13.USART1SEL[2:0] kernel-clock mux: 000 = pclk2, 110 = hsi_div_ck.
#define RCC_CCIPR13     (RCC_BASE + 0x174)
#define RCC_HSICFGR     (RCC_BASE + 0x48)
#define USART1SEL_PCLK2  0b000
#define USART1SEL_HSI    0b110

static void __attribute__((unused)) BL
bl_uart_init(void)
{
  reg_set_bit(RCC_APB2ENR, 4); // USART1 bus clock (register access)

  // Clock the USART1 *kernel* (baud generator) from hsi_div_ck, not the APB
  // bus. HSI is a fixed 64 MHz RC, so the baud is independent of the bus
  // clock — which the boot ROM leaves in an unpredictable state in USB
  // serial boot (a PLL is locked for the USB PHY). HSIDIV (RCC_HSICFGR[8:7])
  // divides HSI; it is 0 (=64 MHz) after reset.
  reg_set_bits(RCC_CCIPR13, 0, 3, USART1SEL_HSI);
  uint32_t hsi = 64000000u >> ((reg_rd(RCC_HSICFGR) >> 7) & 3);

  gpio_conf_af(GPIO_PE(5), 7, GPIO_PUSH_PULL, GPIO_SPEED_LOW, GPIO_PULL_NONE);
  gpio_conf_af(GPIO_PE(6), 7, GPIO_PUSH_PULL, GPIO_SPEED_LOW, GPIO_PULL_NONE);

  reg_wr(USART1_BASE + USART_CR1, 0);
  reg_wr(USART1_BASE + USART_BRR, hsi / 115200);
  reg_wr(USART1_BASE + USART_CR1, (1 << 0) | (1 << 2) | (1 << 3));
}

// Restore the USART1 kernel clock to pclk2 before handing off to mios,
// whose UART driver assumes pclk2.
static void __attribute__((unused)) BL
bl_uart_deinit(void)
{
  reg_set_bits(RCC_CCIPR13, 0, 3, USART1SEL_PCLK2);
}

static void BL
bl_putchar(char c)
{
  while(!(reg_rd(USART1_BASE + USART_SR) & (1 << 7))) {}
  reg_wr(USART1_BASE + USART_TDR, c);
}

static void BL
bl_puts(const char *s)
{
  while(*s) {
    if(*s == '\n')
      bl_putchar('\r');
    bl_putchar(*s++);
  }
}

static void __attribute__((unused)) BL
bl_puthex(uint32_t v)
{
  for(int i = 28; i >= 0; i -= 4) {
    int n = (v >> i) & 0xf;
    bl_putchar(n < 10 ? '0' + n : 'a' + n - 10);
  }
}

// =====================================================================
// Fault handling
// =====================================================================

#define SCB_VTOR    0xE000ED08
#define SCB_SHCSR   0xE000ED24
#define SCB_CFSR    0xE000ED28
#define SCB_HFSR    0xE000ED2C
#define SCB_MMFAR   0xE000ED34
#define SCB_BFAR    0xE000ED38

// Minimal vector table for FSBL (placed in bldata section)
typedef void (*vector_fn)(void);

static void BL bl_hard_fault(void);
static void BL bl_mem_fault(void);
static void BL bl_bus_fault(void);
static void BL bl_usage_fault(void);

// Vector table - must be 128-byte aligned for VTOR
static vector_fn __attribute__((section("blvtbl"), aligned(128), used))
bl_vectors[48] = {
  [0] = (vector_fn)0x34180400,  // MSP (not used, VTOR set after boot)
  [1] = (vector_fn)0,           // Reset (not used)
  [2] = (vector_fn)0,           // NMI
  [3] = bl_hard_fault,
  [4] = bl_mem_fault,
  [5] = bl_bus_fault,
  [6] = bl_usage_fault,
};

static void BL
bl_print_fault(const char *name)
{
  BL_STR(msg_nl, "\n");
  BL_STR(msg_cfsr, "  CFSR: ");
  BL_STR(msg_hfsr, "  HFSR: ");
  BL_STR(msg_mmfar, "  MMFAR: ");
  BL_STR(msg_bfar, "  BFAR: ");

