andoma/mios/src/platform/stm32n6/boot/stm32n6_bootloader.c
  bl_puts(name);
  bl_puts(msg_nl);

  bl_puts(msg_cfsr);
  bl_puthex(reg_rd(SCB_CFSR));
  bl_puts(msg_nl);

  bl_puts(msg_hfsr);
  bl_puthex(reg_rd(SCB_HFSR));
  bl_puts(msg_nl);

  bl_puts(msg_mmfar);
  bl_puthex(reg_rd(SCB_MMFAR));
  bl_puts(msg_nl);

  bl_puts(msg_bfar);
  bl_puthex(reg_rd(SCB_BFAR));
  bl_puts(msg_nl);

  while(1) {}
}

static void BL bl_hard_fault(void)
{
  BL_STR(msg, "FSBL HARD FAULT");
  bl_print_fault(msg);
}

static void BL bl_mem_fault(void)
{
  BL_STR(msg, "FSBL MEM FAULT");
  bl_print_fault(msg);
}

static void BL bl_bus_fault(void)
{
  BL_STR(msg, "FSBL BUS FAULT");
  bl_print_fault(msg);
}

static void BL bl_usage_fault(void)
{
  BL_STR(msg, "FSBL USAGE FAULT");
  bl_print_fault(msg);
}

static void __attribute__((unused)) BL
bl_setup_vtor(void)
{
  // Enable fault handlers (MemManage, BusFault, UsageFault)
  reg_wr(SCB_SHCSR, reg_rd(SCB_SHCSR) | (1 << 16) | (1 << 17) | (1 << 18));

  // Set VTOR to our vector table
  reg_wr(SCB_VTOR, (uint32_t)bl_vectors);
}

// =====================================================================
// Simple delay
// =====================================================================

static void __attribute__((unused)) BL
bl_delay(int count)
{
  for(volatile int d = 0; d < count; d++) {}
}

// =====================================================================
// =====================================================================
// Watchdog
// =====================================================================

#include "stm32n6_wdog.h"

#define WDOG_TIMEOUT_SEC 3
#define WDOG_HZ 128

static void BL
bl_wdog_init(void)
{
  reg_wr(IWDG_KR, 0x5555);
  reg_wr(IWDG_RLR, WDOG_HZ * WDOG_TIMEOUT_SEC);
  reg_wr(IWDG_PR, 6);  // Prescaler (/256) for 32768 -> WDOG_HZ
  reg_wr(IWDG_KR, 0xAAAA);
  reg_wr(IWDG_KR, 0xCCCC);
}

static void BL
bl_wdog_kick(void)
{
  reg_wr(IWDG_KR, 0xAAAA);
}

// =====================================================================
// XSPI1 memory-mapped mode
// Boot ROM already configured XSPI1→XSPIM_P2 (NOR flash) in indirect
// mode. We switch to memory-mapped mode so flash appears at 0x91000000
// (secure alias for XSPIM_P2).
// =====================================================================

#define XSPI1_BASE   0x58025000
#define XSPI2_BASE   0x5802A000
#define XSPIM_BASE   0x5802B400

#define XSPI_CR   0x000
#define XSPI_DCR1 0x008
#define XSPI_DCR2 0x00c
#define XSPI_SR   0x020
#define XSPI_FCR  0x024
#define XSPI_DLR  0x040
#define XSPI_AR   0x048
#define XSPI_DR   0x050
#define XSPI_TCR  0x108
#define XSPI_CCR  0x100
#define XSPI_IR   0x110

static void BL
bl_xspi_wait_busy(uint32_t base)
{
  while(reg_rd(base + XSPI_SR) & (1 << 5)) {}
}

// Test flash access with indirect read (same method as MIOS driver)
static uint32_t __attribute__((unused)) BL
bl_xspi_read_word(uint32_t base, uint32_t addr)
{
  reg_wr(base + XSPI_CR,
         (0b01 << 28) | 1); // FMODE=READ, Enable

  reg_wr(base + XSPI_DLR, 3); // Read 4 bytes

  reg_wr(base + XSPI_CCR,
         (0b001 << 24) |    // Data on single line
         (0b10 << 12) |     // 24-bit address
         (0b001 << 8) |     // Address on single line
         (0b001 << 0));     // Instruction on single line

  reg_wr(base + XSPI_IR, 0x03); // Basic read

  reg_wr(base + XSPI_AR, addr); // Triggers the read

  bl_xspi_wait_busy(base);
  uint32_t val = reg_rd(base + XSPI_DR);
  reg_wr(base + XSPI_FCR, (1 << 1)); // Clear TCF
  return val;
}

#define PWR_BASE     0x56024800
#define PWR_SVMCR3   (PWR_BASE + 0x3c)

static void BL
bl_xspi_init(void)
{
  // Enable VDDIO3 (Port N power supply for NOR flash, 1.8V)
  // This is the key requirement — PLL is NOT needed for XSPI
  reg_set_bit(PWR_SVMCR3, 26); // VDDIO3VRSEL = 1.8V
  reg_set_bit(PWR_SVMCR3, 9);  // VDDIO3SV
  reg_set_bit(PWR_SVMCR3, 1);  // VDDIO3VMEN

  // Boot ROM used XSPI1 (MODE=1, swapped: XSPI1 -> Port 2) to load us, and we
  // keep that config all the way through to mios. Send a flash software reset
  // first, in case the NOR was left in a non-standard mode across NRST.
  clk_enable(CLK_XSPI1);
  clk_enable(CLK_XSPIM);

  // Flash software reset via XSPI1 (boot ROM's controller, known working)
  reg_wr(XSPI1_BASE + XSPI_FCR, 0x1F);  // Clear all flags
  reg_wr(XSPI1_BASE + XSPI_TCR, 0);     // No dummy cycles

  static const uint8_t reset_cmds[] BL_DATA = { 0x66, 0x99 };
  for(int c = 0; c < 2; c++) {
    reg_wr(XSPI1_BASE + XSPI_CR, (0b00 << 28) | 1); // FMODE=WRITE, EN
    reg_wr(XSPI1_BASE + XSPI_DLR, 0);
    reg_wr(XSPI1_BASE + XSPI_CCR, (0b001 << 0));     // Instruction only
    reg_wr(XSPI1_BASE + XSPI_IR, reset_cmds[c]);
    while(!(reg_rd(XSPI1_BASE + XSPI_SR) & (1 << 1))) {} // Wait TCF
    reg_wr(XSPI1_BASE + XSPI_FCR, (1 << 1));
  }
  for(volatile int i = 0; i < 10000; i++) {} // Wait for flash reset

  // Keep using XSPI1 (MODE=1, boot ROM's config) — don't switch XSPIM.
  // The MODE=1→0 switch doesn't work reliably after CubeProgrammer + NRST.
  // Configure XSPI1 for our use.
  reg_wr(XSPI1_BASE + XSPI_CR, 0);    // Disable
  reg_wr(XSPI1_BASE + XSPI_DCR1,
         (23 << 16) | (0b010 << 24));  // DEVSIZE=23, standard mode
  reg_wr(XSPI1_BASE + XSPI_DCR2, 4);  // Prescaler=4 → ~30MHz
  reg_wr(XSPI1_BASE + XSPI_TCR, 0);   // No dummy cycles
}

// XSPI1 memory-mapped base (datasheet: XSPI1 bank at 0x90000000)
// FSBL uses XSPI1 with XSPIM MODE=1 (boot ROM's config, XSPI1→P2)
#define FLASH_MMAP_BASE  0x90000000

static void BL
bl_xspi_mmap_enable(uint32_t base)
{
  reg_wr(base + XSPI_CR, 0); // Disable

  reg_wr(base + XSPI_CCR,
         (0b001 << 24) |    // Data on single line
         (0b10 << 12) |     // 24-bit address
         (0b001 << 8) |     // Address on single line
         (0b001 << 0));     // Instruction on single line

  reg_wr(base + XSPI_IR, 0x03);

  reg_wr(base + XSPI_CR,
         (0b11 << 28) | 1); // FMODE=memory-mapped, Enable
}

// =====================================================================
// XSPI1 indirect NOR write (1-bit SPI), used to provision NOR over DFU.
// All FSBL/app/selector offsets are < 16 MB, so 24-bit addressing is fine.
// =====================================================================

#define XSPI_SR_TCF    (1 << 1)   // transfer complete
#define XSPI_SR_FTF    (1 << 2)   // FIFO threshold (room to write)

