andoma/mios/src/platform/stm32n6/boot/stm32n6_bootloader.c
#define NOR_CMD_WREN   0x06
#define NOR_CMD_RDSR   0x05
#define NOR_CMD_PP     0x02       // page program, 24-bit address
#define NOR_CMD_SE     0x20       // 4 KB sector erase, 24-bit address
#define NOR_PAGE_SIZE  256
#define NOR_SECTOR     4096

// Single instruction, no address or data (e.g. write-enable).
static void BL
bl_nor_cmd(uint8_t cmd)
{
  reg_wr(XSPI1_BASE + XSPI_CR, (0b00 << 28) | 1); // FMODE=WRITE, EN
  reg_wr(XSPI1_BASE + XSPI_DLR, 0);
  reg_wr(XSPI1_BASE + XSPI_CCR, (0b001 << 0));    // instruction, 1 line
  reg_wr(XSPI1_BASE + XSPI_IR, cmd);
  while(!(reg_rd(XSPI1_BASE + XSPI_SR) & XSPI_SR_TCF)) {}
  reg_wr(XSPI1_BASE + XSPI_FCR, XSPI_SR_TCF);
}

static uint8_t BL
bl_nor_status(void)
{
  reg_wr(XSPI1_BASE + XSPI_CR, (0b01 << 28) | 1); // FMODE=READ, EN
  reg_wr(XSPI1_BASE + XSPI_DLR, 0);               // one byte
  reg_wr(XSPI1_BASE + XSPI_CCR, (0b001 << 24) | (0b001 << 0));
  reg_wr(XSPI1_BASE + XSPI_IR, NOR_CMD_RDSR);
  while(!(reg_rd(XSPI1_BASE + XSPI_SR) & XSPI_SR_TCF)) {}
  uint8_t st = reg_rd8(XSPI1_BASE + XSPI_DR);
  reg_wr(XSPI1_BASE + XSPI_FCR, XSPI_SR_TCF);
  return st;
}

// Read the 3-byte JEDEC ID (diagnostic): nonzero/non-0xff => NOR responds.
static uint32_t BL
bl_nor_rdid(void)
{
  reg_wr(XSPI1_BASE + XSPI_CR, (0b01 << 28) | 1); // FMODE=READ, EN
  reg_wr(XSPI1_BASE + XSPI_DLR, 2);               // 3 bytes
  reg_wr(XSPI1_BASE + XSPI_CCR, (0b001 << 24) | (0b001 << 0));
  reg_wr(XSPI1_BASE + XSPI_IR, 0x9F);             // RDID
  while(!(reg_rd(XSPI1_BASE + XSPI_SR) & XSPI_SR_TCF)) {}
  uint32_t id = reg_rd(XSPI1_BASE + XSPI_DR);
  reg_wr(XSPI1_BASE + XSPI_FCR, XSPI_SR_TCF);
  return id;
}

// Read 4 bytes at addr (1-bit fast-read 0x03), TCF-based (diagnostic).
static uint32_t BL
bl_nor_read32(uint32_t addr)
{
  reg_wr(XSPI1_BASE + XSPI_CR, (0b01 << 28) | 1); // FMODE=READ, EN
  reg_wr(XSPI1_BASE + XSPI_DLR, 3);               // 4 bytes
  reg_wr(XSPI1_BASE + XSPI_CCR,
         (0b001 << 24) | (0b10 << 12) | (0b001 << 8) | (0b001 << 0));
  reg_wr(XSPI1_BASE + XSPI_IR, 0x03);
  reg_wr(XSPI1_BASE + XSPI_AR, addr);
  while(!(reg_rd(XSPI1_BASE + XSPI_SR) & XSPI_SR_TCF)) {}
  uint32_t v = reg_rd(XSPI1_BASE + XSPI_DR);
  reg_wr(XSPI1_BASE + XSPI_FCR, XSPI_SR_TCF);
  return v;
}

// Spin until the write-in-progress bit clears, kicking the watchdog.
static void BL
bl_nor_wait_wip(void)
{
  while(bl_nor_status() & 1)
    bl_wdog_kick();
}

static void BL
bl_nor_erase_sector(uint32_t addr)
{
  bl_nor_cmd(NOR_CMD_WREN);
  reg_wr(XSPI1_BASE + XSPI_CR, (0b00 << 28) | 1);
  reg_wr(XSPI1_BASE + XSPI_DLR, 0);
  reg_wr(XSPI1_BASE + XSPI_CCR,
         (0b000 << 24) |   // no data
         (0b10 << 12) |    // 24-bit address
         (0b001 << 8) |    // address, 1 line
         (0b001 << 0));    // instruction, 1 line
  reg_wr(XSPI1_BASE + XSPI_IR, NOR_CMD_SE);
  reg_wr(XSPI1_BASE + XSPI_AR, addr);
  while(!(reg_rd(XSPI1_BASE + XSPI_SR) & XSPI_SR_TCF)) {}
  reg_wr(XSPI1_BASE + XSPI_FCR, XSPI_SR_TCF);
  bl_nor_wait_wip();
}

// Program up to one page (<= 256 bytes, not crossing a page boundary).
static void BL
bl_nor_program_page(uint32_t addr, const uint8_t *src, uint32_t len)
{
  bl_nor_cmd(NOR_CMD_WREN);
  reg_wr(XSPI1_BASE + XSPI_CR, (0b00 << 28) | 1); // FMODE=WRITE, EN
  reg_wr(XSPI1_BASE + XSPI_DLR, len - 1);
  reg_wr(XSPI1_BASE + XSPI_CCR,
         (0b001 << 24) |   // data, 1 line
         (0b10 << 12) |    // 24-bit address
         (0b001 << 8) |    // address, 1 line
         (0b001 << 0));    // instruction, 1 line
  reg_wr(XSPI1_BASE + XSPI_IR, NOR_CMD_PP);
  reg_wr(XSPI1_BASE + XSPI_AR, addr);
  for(uint32_t i = 0; i < len; i++) {
    while(!(reg_rd(XSPI1_BASE + XSPI_SR) & XSPI_SR_FTF)) {}
    reg_wr8(XSPI1_BASE + XSPI_DR, src[i]);
  }
  while(!(reg_rd(XSPI1_BASE + XSPI_SR) & XSPI_SR_TCF)) {}
  reg_wr(XSPI1_BASE + XSPI_FCR, XSPI_SR_TCF);
  bl_nor_wait_wip();
}

// Erase the sectors spanning [addr, addr+len) and program src over them.
static void BL
bl_nor_write(uint32_t addr, const uint8_t *src, uint32_t len)
{
  for(uint32_t a = addr & ~(NOR_SECTOR - 1); a < addr + len; a += NOR_SECTOR)
    bl_nor_erase_sector(a);

  while(len) {
    uint32_t chunk = NOR_PAGE_SIZE - (addr & (NOR_PAGE_SIZE - 1));
    if(chunk > len)
      chunk = len;
    bl_nor_program_page(addr, src, chunk);
    addr += chunk;
    src += chunk;
    len -= chunk;
  }
}

// =====================================================================
// ELF loader
// =====================================================================

#define EI_MAG0    0
#define EI_CLASS   4
#define ELFCLASS32 1
#define EM_ARM     40
#define PT_LOAD    1

typedef struct {
  uint8_t  e_ident[16];
  uint16_t e_type;
  uint16_t e_machine;
  uint32_t e_version;
  uint32_t e_entry;
  uint32_t e_phoff;
  uint32_t e_shoff;
  uint32_t e_flags;
  uint16_t e_ehsize;
  uint16_t e_phentsize;
  uint16_t e_phnum;
  uint16_t e_shentsize;
  uint16_t e_shnum;
  uint16_t e_shstrndx;
} Elf32_Ehdr;

typedef struct {
  uint32_t p_type;
  uint32_t p_offset;
  uint32_t p_vaddr;
  uint32_t p_paddr;
  uint32_t p_filesz;
  uint32_t p_memsz;
  uint32_t p_flags;
  uint32_t p_align;
} Elf32_Phdr;

// Flash partition offsets (must match stm32n6_flash.c)
#define FSBL1_OFFSET        0x000000
#define FSBL2_OFFSET        0x040000
#define BOOTSELECTOR_OFFSET 0x080000
#define APP_A_OFFSET        0x100000
#define APP_B_OFFSET        0x300000

static void BL
bl_memcpy(void *dst, const void *src, uint32_t len)
{
  uint8_t *d = dst;
  const uint8_t *s = src;
  while(len--)
    *d++ = *s++;
}

static void BL
bl_memset(void *dst, int val, uint32_t len)
{
  uint8_t *d = dst;
  while(len--)
    *d++ = val;
}

// Standard CRC-32 matching mios crc32(0, ...) output
static uint32_t BL
bl_crc32(const uint8_t *data, uint32_t len)
{
  uint32_t crc = 0xFFFFFFFF;
  for(uint32_t i = 0; i < len; i++) {
    crc ^= data[i];
    for(int j = 0; j < 8; j++) {
      uint32_t mask = -(crc & 1);
      crc = (crc >> 1) ^ (0xEDB88320 & mask);
    }
  }
  return crc ^ 0xFFFFFFFF;
}

