andoma/mios/src/platform/stm32n6/boot/stm32n6_bootloader.c
#define MIOS_APP_MAGIC    0x5041496d  // "mIAP" little-endian

static int BL
bl_load_elf(const uint8_t *base)
{
  // Check for partition header
  uint32_t magic = *(const uint32_t *)(base + 0);
  uint32_t length = *(const uint32_t *)(base + 4);

  if(magic != MIOS_APP_MAGIC) {
    BL_STR(msg, "  No mIAP header\n");
    bl_puts(msg);
    return -1;
  }

  // Verify CRC trailer: last 12 bytes = [~crc32(4)]["mI0sIMG1"(8)]
  // ~crc32(0, image_data + crc_field, length - 8) == 0
  if(length < 12) {
    BL_STR(msg, "  Image too small\n");
    bl_puts(msg);
    return -1;
  }

  bl_wdog_kick();
  uint32_t crc = bl_crc32(base + 8, length - 8);
  if(~crc != 0) {
    BL_STR(msg, "  CRC mismatch\n");
    bl_puts(msg);
    return -1;
  }

  base += 8;  // Skip partition header, point to ELF

  const Elf32_Ehdr *ehdr = (const Elf32_Ehdr *)base;

  // Validate ELF magic
  if(ehdr->e_ident[0] != 0x7f ||
     ehdr->e_ident[1] != 'E' ||
     ehdr->e_ident[2] != 'L' ||
     ehdr->e_ident[3] != 'F') {
    BL_STR(msg, "  Not an ELF\n");
    bl_puts(msg);
    return -1;
  }

  if(ehdr->e_ident[EI_CLASS] != ELFCLASS32 || ehdr->e_machine != EM_ARM) {
    BL_STR(msg, "  Not ARM32 ELF\n");
    bl_puts(msg);
    return -1;
  }

  const Elf32_Phdr *phdr = (const Elf32_Phdr *)(base + ehdr->e_phoff);

  // Pre-scrub ITCM with 32-bit zero stores so its ECC is valid before any
  // segment is loaded there. bl_memcpy() below is byte-by-byte and would
  // trip ECC read-modify-write faults on uninitialised words otherwise.
  for(volatile uint32_t *p = (volatile uint32_t *)0x00000000;
      p < (volatile uint32_t *)0x00010000; p++) {
    *p = 0;
  }

  for(int i = 0; i < ehdr->e_phnum; i++) {
    if(phdr[i].p_type != PT_LOAD)
      continue;

    // Skip segments targeting the bootloader's own memory (download buffer)
    if(phdr[i].p_paddr >= 0x34180000 && phdr[i].p_paddr < 0x34200000)
      continue;

    BL_STR(msg_load, "  LOAD ");
    BL_STR(msg_arrow, " -> ");
    BL_STR(msg_sz, " (");
    BL_STR(msg_bytes, " bytes)\n");

    bl_puts(msg_load);
    bl_puthex(phdr[i].p_offset);
    bl_puts(msg_arrow);
    bl_puthex(phdr[i].p_paddr);
    bl_puts(msg_sz);
    bl_puthex(phdr[i].p_filesz);
    bl_puts(msg_bytes);

    // Copy segment from memory-mapped flash to RAM
    bl_wdog_kick();
    bl_memcpy((void *)phdr[i].p_paddr,
              base + phdr[i].p_offset,
              phdr[i].p_filesz);

    // Zero-fill BSS (memsz > filesz)
    if(phdr[i].p_memsz > phdr[i].p_filesz) {
      bl_memset((void *)(phdr[i].p_paddr + phdr[i].p_filesz),
                0,
                phdr[i].p_memsz - phdr[i].p_filesz);
    }
  }

  return ehdr->e_entry;
}

// =====================================================================
// Boot ROM context (UM3234 Table 23)
// =====================================================================

struct boot_context {
  uint32_t boot_partition;     // 0=none, 1=FSBL1, 2=FSBL2
  uint32_t sd_err[6];         // SD error counters
  uint32_t emmc_status[3];    // eMMC status
  uint16_t boot_interface;    // 4=sNOR XSPI, 5=UART, 6=USB, 8=HyperFlash
  uint16_t boot_instance;
  uint32_t hse_clock_hz;
  uint32_t reserved;
  uint32_t auth_status;       // 0=none, 1=failed, 2=success
} __attribute__((packed));

// End of the .boot section in the loaded image (linker symbol). The host
// parks the mIAP-wrapped mios ELF immediately after .boot, 32-byte aligned.
extern char _boot_end[];

#include "stm32n6_bootstatus.h"

#define DL_BUFFER_BASE  0x34180000u   // ROM download buffer (secure alias)
#define BOOT_BASE       0x34180400u   // .boot lands here (= _boot_start)

// Erase+program a NOR region, then read back and verify the leading magic
// word. Verbose so a one-shot provisioning is legible on the console.
static int BL
bl_nor_region(const char *name, uint32_t off, const uint8_t *src,
              uint32_t len, uint32_t magic)
{
  BL_STR(s_at, " @0x");
  BL_STR(s_len, " len 0x");
  BL_STR(s_wr, " writing...");
  BL_STR(s_ok, " OK\n");
  BL_STR(s_bad, " VERIFY FAILED, got 0x");
  BL_STR(s_nl, "\n");

  bl_puts(name);
  bl_puts(s_at);  bl_puthex(off);
  bl_puts(s_len); bl_puthex(len);
  bl_puts(s_wr);

  bl_nor_write(off, src, len);

  uint32_t got = bl_nor_read32(off);
  if(got == magic) {
    bl_puts(s_ok);
    return 0;
  }
  bl_puts(s_bad);
  bl_puthex(got);
  bl_puts(s_nl);
  return -1;
}

// Provision NOR from the just-downloaded image in SRAM. The download buffer
// at 0x34180000 holds [STM2 header 0x400][.boot @ 0x400][parked mIAP app].
// Write the FSBL (header + .boot) to both FSBL slots and the parked app to
// both app slots, set the boot selector, and verify each region. The FSBL
// header is the v2.3 image we booted from, re-scoped so image_length and
// checksum cover .boot only (measured from the 0x240 header+ext end, so it
// includes the zero align gap before .boot).
static void BL
bl_provision_nor(void)
{
  BL_STR(m_start, "Provisioning NOR via XSPI1 (1-bit SPI)\n");
  bl_puts(m_start);

  // Route XSPI1 -> Port 2 (the NOR): XSPIM swapped mode, and configure the
  // Port-2 pins (CS/CLK/IO0/IO1). The boot ROM does both for cold boot, but
  // not for USB serial boot.
  clk_enable(CLK_XSPIM);
  reg_wr(XSPIM_BASE, 0x02);  // MUXEN=0, MODE=1 (swapped): XSPI1 <-> Port 2
  gpio_conf_af(GPIO_PN(1), 9, GPIO_PUSH_PULL, GPIO_SPEED_HIGH, GPIO_PULL_NONE);
  gpio_conf_af(GPIO_PN(2), 9, GPIO_PUSH_PULL, GPIO_SPEED_HIGH, GPIO_PULL_NONE);
  gpio_conf_af(GPIO_PN(3), 9, GPIO_PUSH_PULL, GPIO_SPEED_HIGH, GPIO_PULL_NONE);
  gpio_conf_af(GPIO_PN(6), 9, GPIO_PUSH_PULL, GPIO_SPEED_HIGH, GPIO_PULL_NONE);
  bl_xspi_init();

  BL_STR(m_id, "  JEDEC ID 0x");
  BL_STR(m_nl, "\n");
  bl_puts(m_id);
  bl_puthex(bl_nor_rdid());
  bl_puts(m_nl);

  // Re-scope the in-RAM STM2 header for the FSBL slot (.boot only).
  uint32_t boot_padded = (((uint32_t)_boot_end - BOOT_BASE) + 31) & ~31u;
  uint8_t *hdr = (uint8_t *)DL_BUFFER_BASE;
  *(volatile uint32_t *)(hdr + 0x6c) = (0x400 - 0x240) + boot_padded;
  uint32_t sum = 0;
  const uint8_t *boot = (const uint8_t *)BOOT_BASE;
  for(uint32_t i = 0; i < boot_padded; i++)
    sum += boot[i];
  *(volatile uint32_t *)(hdr + 0x64) = sum;
  uint32_t fsbl_len = 0x400 + boot_padded;

  // Parked mIAP app right after .boot; byte length = mIAP length field
  // (elf_len + 12) + the 8-byte magic+length prefix.
  const uint8_t *parked = (const uint8_t *)(((uint32_t)_boot_end + 31) & ~31u);
  uint32_t app_len = *(const uint32_t *)(parked + 4) + 8;

  BL_STR(n_fsbl1, "  FSBL1");
  BL_STR(n_fsbl2, "  FSBL2");
  BL_STR(n_appa, "  App A");
  BL_STR(n_appb, "  App B");
  int bad = 0;
  bad |= bl_nor_region(n_fsbl1, FSBL1_OFFSET, hdr, fsbl_len, 0x324d5453);
  bad |= bl_nor_region(n_fsbl2, FSBL2_OFFSET, hdr, fsbl_len, 0x324d5453);
  bad |= bl_nor_region(n_appa, APP_A_OFFSET, parked, app_len, MIOS_APP_MAGIC);
  bad |= bl_nor_region(n_appb, APP_B_OFFSET, parked, app_len, MIOS_APP_MAGIC);

  // Boot selector: 'A'.
  uint8_t sel = 'A';
  bl_nor_write(BOOTSELECTOR_OFFSET, &sel, 1);
  BL_STR(m_sel, "  Selector 'A' @0x080000\n");
  bl_puts(m_sel);

  // Clean boot status so the cold boot starts fresh.
  reg_wr(BSEC_SCRATCH0, 0);

  BL_STR(m_ok, "NOR provisioning complete\n");
  BL_STR(m_fail, "NOR provisioning FAILED verification\n");
  bl_puts(bad ? m_fail : m_ok);
}

// =====================================================================
// Entry point
// =====================================================================

void __attribute__((noreturn)) BL
bl_main(void *ctx_arg)
{
  // Start the watchdog: resets the chip if FSBL or app startup hangs.
  bl_wdog_init();

  // Bring up the UART for the boot log (clocked from HSI, see bl_uart_init).
  bl_uart_init();

  bl_setup_vtor();

  BL_STR(msg_banner, "MIOS FSBL v1\n");
  bl_puts(msg_banner);

  BL_STR(msg_nl2, "\n");

  // Read and update boot status (BSEC scratch reg, survives reset)
#include "stm32n6_bootstatus.h"

  uint32_t bootstatus = reg_rd(BSEC_SCRATCH0);
  bootstatus |= BOOTSTATUS_FSBL_RAN;

  // Record which FSBL slot ran
  uint32_t ctx_addr = (uint32_t)ctx_arg;
  uint16_t boot_if = 0;
  if(ctx_addr == 0x24100000 || ctx_addr == 0x34100000) {
    const struct boot_context *ctx = ctx_arg;
    if(ctx->boot_partition == 2)
      bootstatus |= BOOTSTATUS_FSBL_SLOT_B;
    boot_if = ctx->boot_interface;
  }

  // Serial boot (boot_interface 5=UART, 6=USB): the ROM downloaded our
  // bootstrap image into SRAM. Provision NOR from it, then drop straight
  // into the freshly-downloaded mios from RAM. NOR is now provisioned, so
  // the next cold boot (BOOT pins -> NOR) runs from flash and OTA takes over.
  // Resetting here would only re-enter the DFU ROM (BOOT0 is still held for
  // DFU), so jump to RAM instead — leaving a running system behind.
  if(boot_if == 5 || boot_if == 6) {
    BL_STR(msg_serial, "Serial boot: provisioning NOR from RAM\n");
    bl_puts(msg_serial);
    bl_provision_nor();

    const uint8_t *parked =
      (const uint8_t *)(((uint32_t)_boot_end + 31) & ~31u);
    int entry = bl_load_elf(parked);
    if(entry > 0) {
      // Reset the XSPI1 controller so mios starts clean. Leave the XSPIM mux
      // at MODE=1 (XSPI1 -> Port 2); mios uses XSPI1 too.
      reg_wr(XSPI1_BASE + XSPI_CR, 0);
      rst_assert(CLK_XSPI1);
      for(volatile int i = 0; i < 100; i++) {}
      rst_deassert(CLK_XSPI1);

      BL_STR(msg_run, "Booting mios from RAM\n");
      bl_puts(msg_run);
      bl_uart_deinit();
      ((void (*)(void))entry)();
    }

    BL_STR(msg_bad, "Parked image load failed, halting.\n");
    bl_puts(msg_bad);
    while(1) {}
  }

