andoma/mios/src/platform/stm32n6/boot/stm32n6_bootloader.c
  // Initialize XSPI and switch to memory-mapped mode
  bl_xspi_init();
  bl_xspi_mmap_enable(XSPI1_BASE);

  const uint8_t *flash = (const uint8_t *)FLASH_MMAP_BASE;

  // Read boot selector: 'B' = slot B, anything else = slot A (default)
  uint8_t selector = flash[BOOTSELECTOR_OFFSET];
  int primary_is_b = (selector == 'B');

  // Determine which slots to try, respecting dirty bits
  uint32_t primary_dirty = primary_is_b ? BOOTSTATUS_APP_B_DIRTY
                                        : BOOTSTATUS_APP_A_DIRTY;
  uint32_t fallback_dirty = primary_is_b ? BOOTSTATUS_APP_A_DIRTY
                                         : BOOTSTATUS_APP_B_DIRTY;

  uint32_t primary_offset  = primary_is_b ? APP_B_OFFSET : APP_A_OFFSET;
  uint32_t fallback_offset = primary_is_b ? APP_A_OFFSET : APP_B_OFFSET;

  int entry = -1;
  int booted_b = primary_is_b;

  if(!(bootstatus & primary_dirty)) {
    // Primary slot is clean — try it
    BL_STR(msg_try, "Boot ");
    bl_puts(msg_try);
    bl_putchar(primary_is_b ? 'B' : 'A');
    bl_puts(msg_nl2);

    bootstatus |= primary_dirty;
    if(primary_is_b)
      bootstatus |= BOOTSTATUS_BOOTED_B;
    else
      bootstatus &= ~BOOTSTATUS_BOOTED_B;
    reg_wr(BSEC_SCRATCH0, bootstatus);

    entry = bl_load_elf(flash + primary_offset);
  } else {
    BL_STR(msg_dirty, "Slot ");
    bl_puts(msg_dirty);
    bl_putchar(primary_is_b ? 'B' : 'A');
    BL_STR(msg_d2, " dirty, skip\n");
    bl_puts(msg_d2);
  }

  if(entry < 0 && !(bootstatus & fallback_dirty)) {
    // Fallback slot is clean — try it
    booted_b = !primary_is_b;
    BL_STR(msg_fb, "Fallback ");
    bl_puts(msg_fb);
    bl_putchar(booted_b ? 'B' : 'A');
    bl_puts(msg_nl2);

    bootstatus |= fallback_dirty;
    if(booted_b)
      bootstatus |= BOOTSTATUS_BOOTED_B;
    else
      bootstatus &= ~BOOTSTATUS_BOOTED_B;
    reg_wr(BSEC_SCRATCH0, bootstatus);

    entry = bl_load_elf(flash + fallback_offset);
  }

  if(entry < 0) {
    BL_STR(msg_halt, "No bootable application, halting.\n");
    bl_puts(msg_halt);
    while(1) {}
  }

  // Jump to application
  BL_STR(msg_jump, "Jumping to ");
  bl_puts(msg_jump);
  bl_puthex(entry);
  bl_puts(msg_nl2);

  // Set VTOR to application vector table (entry should point to reset handler,
  // VTOR is typically at the start of the first PT_LOAD segment)
  // The application's startup code will set VTOR itself.

  // Reset the XSPI1 controller so mios starts clean. Leave the XSPIM mux at
  // MODE=1 (XSPI1 -> Port 2, the ROM's config); mios uses XSPI1 too.
  reg_wr(XSPI1_BASE + XSPI_CR, 0);
  rst_assert(CLK_XSPI1);
  for(volatile int i = 0; i < 100; i++) {}
  rst_deassert(CLK_XSPI1);

  // Jump to application
  bl_uart_deinit();
  typedef void (*app_entry_t)(void);
  app_entry_t app = (app_entry_t)entry;
  app();

  __builtin_unreachable();
}

// bl_fault - called from isr.S if needed before VTOR is set up
void __attribute__((noreturn)) BL
bl_fault(void)
{
  // Try to print if UART was already initialized
  BL_STR(msg, "FSBL EARLY FAULT\n");
  bl_puts(msg);
  while(1) {}
}
